fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодсчетКоличестваДнейОтпуска();
	
КонецПроцедуры 

#КонецОбласти  

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда) 
	
	АдресХранилища = ПоместитьДанныеНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресДанных", АдресХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодсчетКоличестваДнейОтпуска()  
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	
	ОтпускСотрудника = Новый Соответствие;
	КоличествоДнейОтпуска = 0;
	
	Для Каждого Строка Из ТаблицаОтпусков Цикл 
		
		Повтор = ОтпускСотрудника.Получить(Строка.Сотрудник);
		
		Если Повтор = Неопределено Тогда
			КоличествоДнейОтпуска = (Строка.ДатаОкончания - Строка.ДатаНачала)/86400 + 1; 
			ОтпускСотрудника.Вставить(Строка.Сотрудник, КоличествоДнейОтпуска);
		Иначе
			НовоеКоличествоДнейОтпуска = КоличествоДнейОтпуска + (Строка.ДатаОкончания - Строка.ДатаНачала)/86400 + 1;
			ОтпускСотрудника.Вставить(Строка.Сотрудник, НовоеКоличествоДнейОтпуска); 
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Сотрудник Из ОтпускСотрудника Цикл
		
		Если Сотрудник.Значение > 28 Тогда
			
			УстановитьУсловноеОформление(Сотрудник.Ключ)
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьУсловноеОформление(Сотрудник)
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	ЦветФона = ЭлементОформления.Оформление.Элементы.Найти("ЦветФона");
	ЦветФона.Значение = WebЦвета.Красный;
	ЭлементОформления.Использование = Истина;
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Сотрудник;
	ЭлементОтбора.Использование = Истина;  
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	ПолеОформления.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеНаСервере()
	
	ДанныеДляДиаграммы = Объект.ОтпускаСотрудников.Выгрузить();
	
	Адрес = ПоместитьВоВременноеХранилище(ДанныеДляДиаграммы, УникальныйИдентификатор);
	Возврат Адрес; 
	
КонецФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
#КонецОбласти
